%%例10-6已知单位负反馈控制系统的开环传递函数
%%G0(s)=s + 1/s(s + 0.1)(s + 0.2)
%%闭环G(s) = G0(s)/1 + G0(s) = (s + 1)/(s^3 + 0.3s^2 + 1.02s + 1)
%%根据劳斯判据值系统不稳定
z = -1;
p = [0 -0.1 -0.2];
k = 1;
G0 = zpk(z,p,k);
G0.p{:}                 %开环极点，分辨看pzk：GO.p{:},G0.z{:},G0.k
%z和p存的是元胞数组，k是普通数组，{}只对元胞数组有效参见cell_array_matrix_double.m
G = feedback(G0,1);     %单位负反馈
sys1 = tf(G)
sys2 = zpk(sys1);
sys2.p{:}               %获得闭环系统所有极点
roots(sys1.den{:})      %获得所有特征根


%%稳定性判断：劳斯判据→参考(劳斯判据.md)

%%劳斯判据
%   行              第一列                 第二列
%  s^3                1                    1.02    
%  s^2               0.3                    1
%  s^1     0.3*1.02-1*1/0.3 = -2.31         0
%  s^0                 1

%%结论：第一列出现了负数-2.31，变了两次号说明有两个有平面根系统不稳定

